Revit 2026 API

# PointCloudFilterFactoryCreateMultiPlaneFilter(IListPlane) Method

---
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static PointCloudFilter CreateMultiPlaneFilter(
	IList<Plane> planes
)
```
```vb
Public Shared Function CreateMultiPlaneFilter (
	planes As IList(Of Plane)
) As PointCloudFilter
```
```cpp
public:
static PointCloudFilter^ CreateMultiPlaneFilter(
	IList<Plane^>^ planes
)
```
```fsharp
static member CreateMultiPlaneFilter :
        planes : IList<Plane> -> PointCloudFilter
```

#### Parameters

planes IListPlane

#### Return Value

PointCloudFilter

#### Reference

PointCloudFilterFactory Class

CreateMultiPlaneFilter Overload

Autodesk.Revit.DB.PointClouds Namespace